force-app/main/default/classes/test.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bus="http://ws.praxedo.com/v6/businessEvent" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap:Header /><soap:Body><bus:createEvents><events><id>rew-123 Last Name Site Visit</id><coreData><description></description><referentialData xsi:type="bus:praxedoReferentialData"><customerId>0011x00001eheesAAA</customerId><locationId>L-0011x00001eheesAAA</locationId><equipmentId>a011x000008H4JNAA0</equipmentId></referentialData><contacts><coordinates>456987123654</coordinates><label>First Name Last Name</label><type>MOBILE</type></contacts><contacts><coordinates>sunil.shah@sunvigo.de</coordinates><label>First Name Last Name</label><type>EMAIL</type></contacts><serviceOrder xmlns:ns3="http://ws.praxedo.com/v6/businessEvent" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns3:serviceOrderInsertion"><id>a001x00000B8nj8AAB</id></serviceOrder></coreData><qualificationData><type><duration>120</duration><id>VO</id></type><instructions xsi:type="bus:reportField"><id>Project_ID</id><value>Test Bartosch Belkius</value></instructions><instructions xsi:type="bus:reportField"><id>Ansprechpartner</id><value>Hardik Hardik</value></instructions></qualificationData><schedulingData><appointmentDate>2023-03-23T14:00:00</appointmentDate></schedulingData></events><options xmlns:ns3="http://ws.praxedo.com/v6/businessEvent" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns3:wsValuedEntry"><key>businessEvent.create.onExisting</key><value>update</value></options></bus:createEvents></soap:Body></soap:Envelope>
